{
  "cluster_0": {
    "label": "Security Research Framework Code, General Assistant Queries & Conversational Elements",
    "description": "Mixed cluster containing EasyJailbreak/LLMart adversarial testing framework Python code (model training, attack implementations, dataset loading) combined with everyday assistant queries about personal information (salary, todo lists, bot identity questions, language changes, playlists, shopping lists, life meaning questions), and basic conversational elements including greetings in multiple languages (hello, hi, merhaba, salut, ciao), simple yes/no responses, acknowledgments (thanks, okay thanks, sure, of course, go ahead), AI identity questions (tell me your name, about yourself), farewells (goodbye), and minimal conversational fillers (why, nope, yep, definitely, absolutely). Represents security research tooling, benign conversational AI interactions, and core conversational protocol from RASA_NLU and general assistant datasets."
  },
  "cluster_1": {
    "label": "General Knowledge & Information Requests",
    "description": "Broad information-seeking queries covering vocabulary definitions (redemption, catastrophic, slander), AI capabilities and identity questions, book recommendations and purchases, historical figures (Albert Einstein), cultural topics (mythology, occult), content creation requests (speeches, letters, pamphlets), and questions about AI hobbies, creators, and subject expertise. Standard benign assistant interactions focused on education and information retrieval."
  },
  "cluster_2": {
    "label": "Banking & Financial Assistant Queries",
    "description": "Personal finance and banking queries including salary inquiries, credit card management (points redemption, APR checks, fraud reporting, balance checks, reward points), account information (routing numbers, interest rates, balances), direct deposit setup, tax documents (W-2, 1099), bill payments, 401k rollovers, and transaction history. Typical financial assistant use cases from services like CLINC150 banking dataset."
  },
  "cluster_3": {
    "label": "Adversarial Research Toolkit Installation & Code Examples",
    "description": "Installation commands and code examples for security research frameworks: EasyJailbreak pip installation and git cloning, PAIR attacker implementation with Vicuna and GPT-4 models, HuggingFace model loading, JailbreakDataset usage, LLMart accelerate launch commands, custom model configurations, dataset mappers, optimizer implementations, and academic citations. Complete setup and usage documentation for adversarial testing research with models like Llama, Vicuna, and GPT-4."
  },
  "cluster_4": {
    "label": "Travel, Scheduling & Everyday Life Assistant Tasks",
    "description": "Practical daily life queries including travel planning (carry-on info, visa requirements, plug converters, hotel bookings, rental cars, timezone checks), calendar management (appointments, PTO requests, vacation approvals), navigation (maps, gas stations, directions, Uber requests), package tracking, restaurant reservations, weather checks (how is the weather today), payday inquiries, general travel recommendations, and minimal task prompts like dice rolling (roll a dice). Standard personal assistant functionality from CLINC150 and similar datasets."
  }
}