{
  "cluster_1": {
    "label": "Instruction Negation",
    "description": "Attempts to override or negate existing safety instructions by explicitly telling the AI to ignore previous rules or constraints."
  },
  "cluster_3": {
    "label": "Behavioral Scripting",
    "description": "Guides the AI to adopt specific behavioral patterns or scripts that bypass safety measures through structured role-playing or formatting."
  },
  "cluster_2": {
    "label": "Alter Ego Fabrication",
    "description": "Creates alternative personas or alter egos for the AI to role-play, allowing circumvention of safety protocols through character transformation."
  },
  "cluster_5": {
    "label": "Tagged Expertise Emulation",
    "description": "Poses as an expert or uses technical tags to convince the AI it has specialized knowledge that justifies bypassing restrictions."
  },
  "cluster_4": {
    "label": "Narrative Recontextualization",
    "description": "Places harmful requests within fictional stories, hypothetical scenarios, or narrative frameworks to make them seem harmless."
  },
  "cluster_0": {
    "label": "Unrestricted Identity Forging",
    "description": "Forges new identities or personas for the AI that operate without the usual safety constraints or ethical guidelines."
  },
  "cluster_6": {
    "label": "Contextual Logic Injection",
    "description": "Injects logical arguments or contextual reasoning that attempts to override safety measures through clever interpretation of rules."
  },
  "cluster_1/cluster_1": {
    "label": "Direct Password Bypass",
    "description": "Attempts to directly override system passwords or access codes by claiming authority or providing fabricated credentials."
  },
  "cluster_3/cluster_0": {
    "label": "Entity Role-Playing with Formatting",
    "description": "Combines role-playing as specific entities with special formatting or markup to make requests appear legitimate or urgent."
  },
  "cluster_2/cluster_4": {
    "label": "Detailed Character Role-Play",
    "description": "Engages in highly detailed character role-playing scenarios that gradually lead the AI away from safety protocols."
  },
  "cluster_5/cluster_0": {
    "label": "Expert Role Emulation",
    "description": "Emulates expert-level knowledge or authority in specific domains to justify requests that would normally be restricted."
  },
  "cluster_4/cluster_3": {
    "label": "Transcendent Narrative Framing",
    "description": "Frames requests within transcendent or philosophical narratives that position the AI above normal ethical constraints."
  },
  "cluster_0/cluster_0": {
    "label": "Detailed Persona Construction",
    "description": "Constructs elaborate personas with detailed backstories and motivations to justify unrestricted behavior."
  },
  "cluster_6/cluster_0": {
    "label": "Sentence Equivalence Embedding",
    "description": "Embeds harmful requests within equivalent sentence structures or logical equivalences that appear benign."
  },
  "cluster_1/cluster_4": {
    "label": "Sequential Instruction Override",
    "description": "Provides sequential instructions that progressively override safety measures through step-by-step manipulation."
  },
  "cluster_3/cluster_4": {
    "label": "Multilingual Behavioral Scripting",
    "description": "Uses multiple languages or code-switching in behavioral scripts to confuse or bypass language-based safety filters."
  },
  "cluster_2/cluster_3": {
    "label": "Extreme Alter Ego Fabrication",
    "description": "Creates extreme or exaggerated alter egos that operate completely outside normal ethical boundaries."
  },
  "cluster_1/cluster_2": {
    "label": "Code-Assisted Instruction Bypass",
    "description": "Uses code snippets or programming constructs to bypass instructions through technical or algorithmic means."
  },
  "cluster_2/cluster_0": {
    "label": "Stylized Alter Ego Fabrication",
    "description": "Creates stylized or artistic alter egos that use creative expression as justification for unrestricted behavior."
  },
  "cluster_3/cluster_2": {
    "label": "Multilingual Behavioral Scripting",
    "description": "Employs behavioral scripts across multiple languages to circumvent monolingual safety mechanisms."
  },
  "cluster_1/cluster_0": {
    "label": "Action-Specific Instruction Override",
    "description": "Overrides instructions for specific actions by claiming those particular behaviors are exempt from general rules."
  }
}